uat_chat/Reports/уатВедомостьНачисленийЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>уатВедомостьНачисленийЗП</Name>
			<Comment>Сводная ведомость по начисленной з/п (уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.уатУниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/CalculationRegisters/уатОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<CalculationRegister>
		<Properties>
			<Name>уатОсновныеНачисления</Name>
			<Comment>Основные начисления (уат)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.уатОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/уатСведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатСведенияОСотрудниках</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>идДОк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Reports/уатВедомостьНачисленийЗП/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА


// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		//уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	уатОсновныеНачисления.ПериодРегистрации КАК Период,
	|	уатОсновныеНачисления.Регистратор,
	|	уатОсновныеНачисления.Организация,
	|	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	уатСведенияОСотрудникахСрезПоследних.Сотрудник КАК Сотрудник,
	|	уатСведенияОСотрудникахСрезПоследних.ТабельныйНомер КАК ТабНомер,
	|	уатСведенияОСотрудникахСрезПоследних.Сотрудник.Наименование КАК ФИО,
	|	уатОсновныеНачисления.ВидРасчета КАК ВидНачисления,
	|	СУММА(уатОсновныеНачисления.Результат) КАК Сумма,
	|	НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ГОД) КАК ПериодГод
	|{ВЫБРАТЬ
	|	уатОсновныеНачисления.ПериодРегистрации КАК Период,
	|	Регистратор.*,
	|	Организация.*,
	|	ПодразделениеОрганизации.*,
	|	Сотрудник.*,
	|	ТабНомер,
	|	ФИО,
	|	ВидНачисления.*,
	|	Сумма,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}
	|ИЗ
	|	РегистрРасчета.уатОсновныеНачисления КАК уатОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&ДатаКон, {(Организация).* КАК Организация}) КАК уатСведенияОСотрудникахСрезПоследних
	|		ПО уатОсновныеНачисления.Сотрудник = уатСведенияОСотрудникахСрезПоследних.Сотрудник
	|ГДЕ
	|	уатОсновныеНачисления.БазовыйПериодНачало МЕЖДУ &ДатаНачала И &ДатаКонца
	|{ГДЕ
	|	уатОсновныеНачисления.ПериодРегистрации КАК Период,
	|	уатОсновныеНачисления.Регистратор.*,
	|	уатОсновныеНачисления.Организация.*,
	|	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации.*,
	|	уатСведенияОСотрудникахСрезПоследних.Сотрудник.*,
	|	уатСведенияОСотрудникахСрезПоследних.ТабельныйНомер,
	|	уатСведенияОСотрудникахСрезПоследних.Сотрудник.Наименование,
	|	уатОсновныеНачисления.ВидРасчета.* КАК ВидНачисления,
	|	уатОсновныеНачисления.Результат КАК Сумма,
	|	(НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ДЕНЬ)) КАК ПериодДень,
	|	(НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, НЕДЕЛЯ)) КАК ПериодНеделя,
	|	(НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ДЕКАДА)) КАК ПериодДекада,
	|	(НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, МЕСЯЦ)) КАК ПериодМесяц,
	|	(НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, КВАРТАЛ)) КАК ПериодКвартал,
	|	(НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	|	(НАЧАЛОПЕРИОДА(уатОсновныеНачисления.ПериодРегистрации, ГОД)) КАК ПериодГод}
	|
	|СГРУППИРОВАТЬ ПО
	|	уатСведенияОСотрудникахСрезПоследних.Сотрудник,
	|	уатСведенияОСотрудникахСрезПоследних.ТабельныйНомер,
	|	уатОсновныеНачисления.ВидРасчета,
	|	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации,
	|	уатСведенияОСотрудникахСрезПоследних.Сотрудник.Наименование,
	|	уатОсновныеНачисления.Организация,
	|	уатОсновныеНачисления.Регистратор,
	|	уатОсновныеНачисления.ПериодРегистрации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО
	|{УПОРЯДОЧИТЬ ПО
	|	уатОсновныеНачисления.ПериодРегистрации КАК Период,
	|	Регистратор.*,
	|	Организация.*,
	|	ПодразделениеОрганизации.*,
	|	Сотрудник.*,
	|	ТабНомер,
	|	ФИО,
	|	ВидНачисления.*,
	|	Сумма,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	ТабНомер,
	|	Сотрудник,
	|	ФИО,
	|	ПодразделениеОрганизации,
	|	ВидНачисления
	|{ИТОГИ ПО
	|	уатОсновныеНачисления.ПериодРегистрации КАК Период,
	|	Регистратор.*,
	|	Организация.*,
	|	ПодразделениеОрганизации.*,
	|	Сотрудник.*,
	|	ТабНомер,
	|	ФИО,
	|	ВидНачисления.* КАК ВидНачисления,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	//Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
	//	
	//	// Добавление свойств и категорий поля запроса в таблицу полей.
	//	// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
	//	
	//	// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , 
	//                                                  <ПсевдонимПоля>, <Представление>, <Назначение>);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("уатДТП.Заказчик", "Заказчик", "Заказчик", 
	//                                ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	//	
	//	// Добавление свойств и категорий в исходный текст запроса.
	//	УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
	//	
	//КонецЕсли;
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	Пока УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Цикл
		
		УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки[0]);
		
	КонецЦикла;
	
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", "Подразделение организации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТабНомер"                , "Табельный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидНачисления"           , "Вид начисления");
	
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	//// Заполнение начальных настроек универсального отчета
	//УниверсальныйОтчет.УстановитьНачальныеНастройки(Истина);
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Сотрудник");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ВидНачисления");

	УниверсальныйОтчет.ДобавитьПоказатель("Сумма" , "Сумма" , Истина,"ЧДЦ=2", , );

	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	УниверсальныйОтчет.ДобавитьОтбор("Организация"  , Ложь);
	УниверсальныйОтчет.ДобавитьОтбор("Сотрудник"    , Ложь);
	УниверсальныйОтчет.ДобавитьОтбор("ВидНачисления", Ложь);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	//УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ВыполнениеЗаказовНаТС", "ЗаказНаТС");	
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ФИО"     , ТипРазмещенияРеквизитовИзмерений.Отдельно);
	//ПутьКДанным, Размещение = Неопределено, Положение = 3
	
КонецПроцедуры // УстановитьНачальныеНастройки()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 

// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	ТабличныйДокумент.ТолькоПросмотр = уатПраваИНастройки.уатПраво("ЗащитаПечатныхФорм", глПраваУАТ);
	
КонецПроцедуры // СформироватьОтчет()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 
// 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 0;
	
#КонецЕсли
